app/controllers/authentication_controller.rb

  def signup
    user = User.new(user_params)

    if user.save
---
INSERT INTO `users` (`username`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('ness', 'test@test.com', '$2a$12$GGKdIAq7oadYfhpPSWeIwOJgPll5bfNBouT16vrRvBOeGOuntsGKO', '2023-06-29 08:30:41.957631', '2023-06-29 08:30:41.957631')

  def login
    user = User.find_by(username: params[:username])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'test' LIMIT 1